Revit 2027 API
RuledFace.Curve Property
Profile curves of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve this[
	int index
] { get; }
Public ReadOnly Property Curve (
	index As Integer
) As Curve
	Get
public:
property Curve^ Curve[int index] {
	Curve^ get (int index);
}
member Curve : Curve with get
Parameters
index Int32
Property Value
Curve
See Also
Reference
RuledFace Class
Autodesk.Revit.DB Namespace